---
kind: method
id: M:Autodesk.Revit.DB.Structure.ReinforcementSettings.GetRebarRoundingManager
source: html/0471fc13-76ea-a071-b6b6-f26586ba7dd6.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementSettings.GetRebarRoundingManager Method

Returns an object for managing reinforcement rounding override settings used by RebarBarTypes, Rebar and RebarInSystem elements.

## Syntax (C#)
```csharp
public RebarRoundingManager GetRebarRoundingManager()
```

## Returns
The rounding manager.